const SIZE: usize = 5; // Задайте розмір ромба

fn main() {
    // Верхня частина ромба
    for i in 0..SIZE {
        for _ in 0..SIZE - i - 1 {
            print!(" "); // Виводимо пробіли
        }
        for _ in 0..2 * i + 1 {
            print!("*"); // Виводимо зірочки
        }
        println!(); // Перехід на новий рядок
    }

    // Нижня частина ромба
    for i in (0..SIZE - 1).rev() {
        for _ in 0..SIZE - i - 1 {
            print!(" "); // Виводимо пробіли
        }
        for _ in 0..2 * i + 1 {
            print!("*"); // Виводимо зірочки
        }
        println!(); // Перехід на новий рядок
    }
}
